[
    {
        "id": 1,
        "title": "O que é Big Data e o porque dos seus 5 V’s",
        "author": "Rafael Wolf",
        "pubDate": "2020-04-22 00:35:47",
        "imgAuthor": "https://cdn-images-1.medium.com/fit/c/150/150/2*GsuIVZfZIM6qtL92QWlsNw.png",
        "link": "https://medium.com/@rafael.wolf/o-que-%C3%A9-big-data-e-o-porque-dos-seus-5-vs-7e3e43e3c341?source=rss-75470c364068------2",
        "thumbnail": "https://cdn-images-1.medium.com/max/960/1*8sLlApeuxRw9ifb8LdNnwg.png",
        "description": "<p>Se você se interessa ou está ligado de alguma forma a tecnologia, com certeza já ouviu alguém falar em Big Data.<br>Neste post gostaria de falar um pouco sobre esse assunto, que está tão em foco nos dias atuais.<br>Para isto precisamos entender da onde surgiu o termo “Big Data”, e o porque ele está baseado em “5 V’s”.</p>",
        "content": "<figure><img alt='Ilustração, teclado com a descrição BIG DATA' src='https://cdn-images-1.medium.com/max/960/1*8sLlApeuxRw9ifb8LdNnwg.png'></figure><p>Se você se interessa ou está ligado de alguma forma a tecnologia, com certeza já ouviu alguém falar em Big Data.<br>Neste post gostaria de falar um pouco sobre esse assunto, que está tão em foco nos dias atuais.<br>Para isto precisamos entender da onde surgiu o termo “Big Data”, e o porque ele está baseado em “5 V’s”.</p> <p><strong>Mas afinal o que é Big Data?</strong></p> <p>Big Data é o termo usado para descrever a enorme massa de dados, tanto estruturados quanto não estruturados, que estamos gerando, sejam públicos ou privados e crescem a cada segundo.<br>Vivendo na era da verdadeira revolução de dados, nunca antes na história geramos tanta informação como nos dias atuais.<br>Esta enorme massa de dados que é construída a cada segundo, por cada um de nós direta ou indiretamente.</p> <p>Para termos uma noção desse volume de dados, podemos citar o estudo “A Universe of Opportunities and Challenges”, elaborado pele EMC em dezembro de 2012, segundo o estudo e estimativa é que o volume de dados gerados em todo o mundo chegue a 40 Zettabytes em 2020.<br>(*) — 1 Zettabyte corresponde a 1 trilhão de gigabytes.</p> <p><strong>Quais os 5 V’s do Big Data?</strong></p> <p><strong>1) — Volume<br></strong>Pense no volume de dados que geramos a cada segundo, direta ou indiretamente, até mesmo quando não estamos conectados.<strong><br></strong>Sistemas de controle, sistemas gerenciais, telemetria, dispositivos de IOT, redes sociais, aplicativos de mensagens, etc.</p> <p><strong>2) — Velocidade</strong><br>Agora imagine na velocidade em que esses dados são criados. Pense na infinidade de sistemas que já existem e nos novos sistemas que estão sendo criados para analisar dados já existentes e criar novos.<br>Análises de fraude, análises de crédito, análises de perfil de consumo, dados de redes sociais, etc. Muito provavelmente, neste exato momento, deve haver algum sistema que esteja processando alguma informação sua.</p> <p><strong>3) — Variedade<br></strong>A alguns poucos anos atrás, a maioria das informações eram armazenadas em banco de dados relacionais, eram portando dados estruturados. Hoje, cerca de 80% dos dados do mundo não são estruturados.<br>São fotos, posts, compartilhamentos, textos, vídeos, áudios, etc. Todos podem conter conteúdos que sejam relevantes em algum momento, portanto precisam ser analisados.</p> <p><strong>4) — Veracidade</strong><br>A veracidade se faz necessária em Big Data para garantir o correto relacionamento entre essa grande massa de dados não relacional, para que se possa assim chegar a análises corretas.<br>Um dos grandes desafios do Big Data é justamente relacionar de maneira correta dados não estruturados, com grande variedade e de diferentes fontes.</p> <p><strong>5) — Valor</strong><br>E o 5º e último V é o que levou o Big Data a ser o que é hoje.<br>De nada adiantaria termos acesso a essa enorme massa de dados, termos disponíveis ferramentas fantásticas de analise, se estes dados não gerassem valor.<br>Hoje a maioria das empresas já reconhecem o enorme potencial em analisar essa massa de dados, podendo identificar assim, perfis de consumo, necessidades de mercado, etc, etc e etc.<br>É um mercado em franca expansão e não podemos mensurar onde iremos chegar, as possibilidades são infinitas se tomarmos por base que novas informações são geradas a todo momento.</p> <p><strong>Qual o grande desafio?</strong></p> <p>Com certeza o grande desafio é saber tratar e analisar o que realmente é relevante para cada tipo de negócio, saber como armazenar de forma otimizada os dados gerados para que possam posteriormente ser analisados e gerar realmente valor e conhecimento.</p> <p><strong>Referências:</strong><br>Gantz, John and Reinsel. (2012). David. The Digital Universe In 2020: Big Data, Bigger Digital Shadows, and Biggest Growth in the Far East. EMC Corporation.<br>Disponível em: <a href='https://www.emc.com/leadership/digital-universe/2012iview/index.htm'>https://www.emc.com/leadership/digital-universe/2012iview/index.htm</a></p> <img src='https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=7e3e43e3c341' width='1' height='1' alt=''> ",
        "categories": [
            "Big Data",
            "Back-End"
        ]
    },
    {
        "id": 2,
        "title": "Porque é preciso construir um HTML semântico?",
        "author": "Gabriel Martins",
        "pubDate": "2021-05-11 00:33:13",
        "imgAuthor": "https://cdn-images-1.medium.com/fit/c/150/150/0*Fb2pqNYBWKW_OJDh.jpg",
        "link": "https://medium.com/@gabrielw-contato?source=rss-a1fde682d851------2",
        "thumbnail": "https://cdn-images-1.medium.com/max/640/1*JQLo1YrKpS2m87nmRgwL-Q.jpeg",
        "description": "<p>Você já deve ter visitado um site onde o código HTML é encadeado por várias tags “div”, principalmente quando se utiliza algum framework CSS3 como o Bootstrap. Pode ser que o desenvolvimento de um site utilizando tags repetidas seja mais rápido e fácil, porém futuramente isso pode prejudicar muito o seu projeto como um todo.</p>",
        "content": "<figure><img alt='' src='https://cdn-images-1.medium.com/max/640/1*JQLo1YrKpS2m87nmRgwL-Q.jpeg'><figcaption><strong>Imagem de </strong><a href='https://pixabay.com/pt/users/lmonk72-731125/?utm_source=link-attribution&amp;amp;utm_medium=referral&amp;amp;utm_campaign=image&amp;amp;utm_content=647013'><strong>Lawrence Monk</strong></a><strong> por </strong><a href='https://pixabay.com/pt/?utm_source=link-attribution&amp;amp;utm_medium=referral&amp;amp;utm_campaign=image&amp;amp;utm_content=647013'><strong>Pixabay</strong></a></figcaption></figure><p>Você já deve ter visitado um site onde o código HTML é encadeado por várias tags “div”, principalmente quando se utiliza algum framework CSS3 como o Bootstrap. Pode ser que o desenvolvimento de um site utilizando tags repetidas seja mais rápido e fácil, porém futuramente isso pode prejudicar muito o seu projeto como um todo.</p> <h3>Significado da palavra “Semântica”:</h3> <p>Resumidamente, semântica é o estudo do significado, dar sentido e interpretação sobre algo, ou seja, HTML semântico é <strong>dar sentido ao seu código</strong> de forma que ele fique fácil de ler, organizado, padronizado, acessível com a utilização de tags apropriadas, antigamente no <strong>HTML4</strong> <strong>não se importava muito sobre significado</strong> e sim a <strong>forma do código</strong>, várias tags que estão <strong>obsoletas no HTML5 </strong>eram utilizadas para dar forma e que atualmente é feito facilmente com CSS3, como a tag “&lt;center&gt;conteúdo…&lt;/center&gt;” para centralizar o texto.</p> <p>Há várias razões para se aplicar o HTML semântico além de deixar o trabalho do desenvolvedor mais profissional, segue abaixo algumas das razões:</p> <h3><strong>Organização de código:</strong></h3> <p>Um HTML semântico deixa o seu código bem mais <strong>organizado, fácil de ler e fazer manutenção</strong>, um grande exemplo é quando um projeto tem vários profissionais trabalhando na camada do Front-End e aplicando padrões de projeto CSS junto com um HTML semântico facilita demais o <strong>entendimento da construção código.</strong></p> <h3><strong>Acessibilidade e Experiência do Usuário:</strong></h3> <p>Acessibilidade vem ganhando muito espaço e valorização dentre os desenvolvedores Front-End, infelismente não são todas as empresas e aplicações web que aplicam este conceito.</p> <p>Muitos usuários são pessoas com algum tipo de deficiência que utilizam vários tipos de <strong>ferramentas para auxiliar na navegação web</strong>, como por exemplo o<strong> leitor de tela</strong> e para que um leitor consiga ler o conteúdo de algum aplicação web, de forma adequada, é necessário que o <strong>código esteja semântico</strong>, segundo as normas da<strong> W3C</strong>, assim a leitura feita pelo software como o NVDA é realizada de forma coerente para que o usuário entenda aonde ele se localiza na aplicação visitada, quais são as próximas ações que ele pode fazer, tendo a <strong>liberdade de usufruir de tudo que a página web pode propor.</strong></p> <p>Um erro clássico é os desenvolvedores <strong>esquecerem de utilizar o atributo “alt”</strong> na imagem, isso faz a maior diferença quando o NVDA tenta ler o conteúdo proposto naquela tag “img”.</p> <p>Quando for implementar um menu mobile com um ícone de hambúrguer, insira atributos<strong> </strong><a href='https://www.w3.org/TR/html-aria/'><strong>WAI-ARIA</strong></a> para descrever qual ação o ícone realiza, nesse caso abre o menu de navegação. Muitas tags HTML, <strong>principalmente as que vão interagir com o JavaScript</strong>, não contém algum atributo para descrever a ação realizada, por isso é importante utilizar os<strong> atributos ARIA</strong>.</p> <p>E por conta da sua <strong>aplicação ser acessível</strong>, consequentemente terá uma <strong>experiência maior de usuário</strong>, trazendo mais clientes querendo consumir o seu produto.</p> <h3>Utilize somente um h1 em cada página HTML:</h3> <p>Em questões de acessibilidade é muito importante que se utiliza somente um h1 e vai abaixando a hierarquia dos títulos conforme vai necessitando, normalmente subtítulos são h2 e outros supostos títulos ou conteúdos em destaque, utilize h3,h4,h5… ou até mesmo estilize no CSS3.</p> <h3>Conclusão:</h3> <p>Neste post, eu quis abordar de forma geral o nível de importância da implementação do HTML semântico nos dias atuais, principalmente na questão de acessibilidade, trazendo os principais tópicos.</p> <p>Em questão da estrutura do HTML, você vai descobrindo na prática e estudando de forma mais aprofundada as tags que são muitas! Porém se você saber as principais já é o suficiente para conseguir alcançar um HTML mais semântico e organizado.</p> <img src='https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=5bc8ffcf5dd6' width='1' height='1' alt=''> ",
        "categories": [
            "Front-End",
            "HTML5 Semântico"
        ]
    },
    {
        "id": 3,
        "title": "Diferença entre var, let e const no JavaScript.",
        "author": "Gabriel Martins",
        "pubDate": "2021-07-03 20:42:20",
        "imgAuthor": "https://cdn-images-1.medium.com/fit/c/150/150/0*Fb2pqNYBWKW_OJDh.jpg",
        "link": "https://gabrielw-contato.medium.com/diferen%C3%A7a-entre-var-let-e-const-no-javascript-ffd2384385a4",
        "thumbnail": "https://cdn-images-1.medium.com/max/1024/1*qZk0Zee2kLp0fis1eoF_Hg.jpeg",
        "description": "<p>Para que possamos armazenar os nossos dados e alocar na memória do navegador ou computador utilizamos as variáveis, entretanto com o ES6 do JavaScript foi adicionado outras duas formas de se armazenar dados, economizar memória e resolver problemas de escopo que é o let e const.</p>",
        "content": "<figure><img alt='Códigos em um ambiente de desenvolvimento' src='https://cdn-images-1.medium.com/max/1024/1*qZk0Zee2kLp0fis1eoF_Hg.jpeg'><figcaption><strong>Photo by Joan Gamell on Unsplash</strong></figcaption></figure><p>Para que possamos armazenar os nossos dados e alocar na memória do navegador ou computador utilizamos as variáveis, entretanto com o <em>ES6</em> do JavaScript foi adicionado outras duas formas de se armazenar dados, economizar memória e resolver problemas de escopo que é o <em>let e const</em>.</p> <p>Primeiramente o <em>var</em> do JavaScript é uma variável global, ou seja, em alguns escopos o<em> var</em> declarado pode vazar, podendo acessar fora do seu escopo definido:</p> <figure><img alt='' src='https://cdn-images-1.medium.com/max/800/1*KnabpeSiqLpHtAiQpydPXg.png'></figure><p>Podemos perceber que o <em>var “preco”</em> definido no escopo do <em>for</em> foi fazado quando acessamos a variável depois, diferente do escopo da função <em>“aumentoPreco”</em>, onde eu tentei consultar o valor da variável <em>“limite”</em> que não foi possível, pois a <em>function</em> não deixa o <em>var</em> ser vazado no seu escopo.</p> <p>Além do <em>for</em>, o <em>var</em> é vazado no<em> while, do while, if </em>e no<em> switch.</em></p> <p><strong>Observação:</strong> Quando consultamos o valor da variável <em>“preco”</em> do <em>for</em>,<strong> o valor que foi invalido</strong> na sua condição foi armazenado dentro do escopo da variável, pois o limite era 15 e o valor no <em>console.log</em> foi printado 16.</p> <p>Assim surgiu o <em>let </em>que resolve esse vazamento do <em>var</em>, pois ele respeita o escopo onde foi declarado, por isso o <em>let </em>é chamado de <em>“variável de escopo”</em>.</p> <figure><img alt='' src='https://cdn-images-1.medium.com/max/800/1*AsHLyCRqry48v663CrXMfA.png'></figure><p>No mesmo código, podemos perceber que o<em> let “preco”</em> não foi vazado quando consultamos o seu valor fora do escopo do <em>for</em>, dando o erro <em>“preco is not defined”</em>, assim a variável <em>“preco” </em>está respeitando o escopo do <em>for</em>.</p> <p>Agora o <em>const </em>é o mais restritivo das variáveis e também um dos mais utilizados além do <em>let</em>, ele tem o mesmo princípio de respeitar o escopo onde foi declarado, mas além disso não se deve reatribuir um outro valor, pois <em>const </em>vem de <strong>constante</strong>, ou seja, <strong>nunca muda.</strong></p> <figure><img alt='' src='https://cdn-images-1.medium.com/max/800/1*wDsmbTgzpJPBfJz4exEVVA.png'></figure><p>No resultado desse código acima, percebe-se que <em>var </em>e <em>let </em>foi possível reatribuir valores, entretanto o <em>const</em>, por ser uma constante, não foi possível modificar o seu valor já declarado inicialmente, assim quando demos um <em>“console.log(nome3)” </em>houve o erro<em> ‘Assignment to constant variable’, </em>pois tentamos trocar o valor já declarado inicialmente na constante <em>“nome3”.</em></p> <p>Neste post, eu queria citar essas principais diferenças básicas do <em>var, let</em> e <em>const</em>. É uma boa prática sempre utilizar <em>const </em>e <em>let </em>por conta de resolver futuros problemas de código quando a aplicação crescer, além de economizar a memória, gerando melhor desempenho na sua aplicação.</p> <p>Espero ter ajudado de alguma forma :)</p> <img src='https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=ffd2384385a4' width='1' height='1' alt=''>",
        "categories": [
            "Front-End",
            "JavaScript"
        ]
    }
]